wise-broker/request-epoli.html

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <EmettiPolizze xmlns="http://www.inteksrl.it">
      <azioniEPOLI>
        <azioneepoli>
          <dt_incasso xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">dateTime</dt_incasso>
          <flg_tipo_incasso xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</flg_tipo_incasso>
          <forza_premio xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</forza_premio>
          <forza_provvigioni xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</forza_provvigioni>
          <forza_tasse xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</forza_tasse>
          <incassa_polizza xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</incassa_polizza>
          <numero_polizza_base xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</numero_polizza_base>
          <progr_operazione xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">long</progr_operazione>
          <identificativo_esterno_operazione xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</identificativo_esterno_operazione>
          <stampa_polizza xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</stampa_polizza>
          <verifica_premio xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</verifica_premio>
          <causale_riconciliazione_bancaria xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</causale_riconciliazione_bancaria>
          <attiva_processo_deroga xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</attiva_processo_deroga>
          <incasso_direzionale xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</incasso_direzionale>
          <login xmlns="urn:WiseWebServicePtf.Login">
            <username>string</username>
            <password>string</password>
          </login>
          <polizza xmlns="urn:WiseWebServicePtf.Polizza">
            <id_polizza>long</id_polizza>
            <n_rif_esterno>string</n_rif_esterno>
            <n_polizza>string</n_polizza>
            <n_proposta>string</n_proposta>
            <n_preventivo>string</n_preventivo>
            <cod_compagnia_ania>string</cod_compagnia_ania>
            <cod_ramo>string</cod_ramo>
            <cod_prodotto>string</cod_prodotto>
            <dt_effetto>dateTime</dt_effetto>
            <dt_scadenza>dateTime</dt_scadenza>
            <hhmm_effetto>string</hhmm_effetto>
            <hhmm_scadenza>string</hhmm_scadenza>
            <stato_contratto>string</stato_contratto>
            <contratto xsi:nil="true" xmlns="urn:WiseWebServicePtf.Contratto" />
            <coll_contraente xsi:nil="true" xmlns="urn:WiseWebServicePtf.Contraenti" />
            <coll_allegati xsi:nil="true" xmlns="urn:WiseWebServicePtf.Allegati" />
            <coll_bene xsi:nil="true" xmlns="urn:WiseWebServicePtf.Beni" />
            <coll_coass xsi:nil="true" xmlns="urn:WiseWebServicePtf.Coass" />
            <coll_regpremio xsi:nil="true" xmlns="urn:WiseWebServicePtf.RegolazionePremi" />
            <coll_variabilepolizza xsi:nil="true" xmlns="urn:WiseWebServicePtf.VariabiliPolizza" />
            <coll_polizzacollegata xsi:nil="true" xmlns="urn:WiseWebServicePtf.PolizzeCollegate" />
            <premiofirma xsi:nil="true" xmlns="urn:WiseWebServicePtf.PremioFirma" />
          </polizza>
        </azioneepoli>
        <azioneepoli>
          <dt_incasso xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">dateTime</dt_incasso>
          <flg_tipo_incasso xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</flg_tipo_incasso>
          <forza_premio xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</forza_premio>
          <forza_provvigioni xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</forza_provvigioni>
          <forza_tasse xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</forza_tasse>
          <incassa_polizza xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</incassa_polizza>
          <numero_polizza_base xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</numero_polizza_base>
          <progr_operazione xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">long</progr_operazione>
          <identificativo_esterno_operazione xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</identificativo_esterno_operazione>
          <stampa_polizza xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</stampa_polizza>
          <verifica_premio xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</verifica_premio>
          <causale_riconciliazione_bancaria xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">string</causale_riconciliazione_bancaria>
          <attiva_processo_deroga xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</attiva_processo_deroga>
          <incasso_direzionale xmlns="urn:WiseWebServicePtf.Azioni.AzioneEPOLI">boolean</incasso_direzionale>
          <login xmlns="urn:WiseWebServicePtf.Login">
            <username>string</username>
            <password>string</password>
          </login>
          <polizza xmlns="urn:WiseWebServicePtf.Polizza">
            <id_polizza>long</id_polizza>
            <n_rif_esterno>string</n_rif_esterno>
            <n_polizza>string</n_polizza>
            <n_proposta>string</n_proposta>
            <n_preventivo>string</n_preventivo>
            <cod_compagnia_ania>string</cod_compagnia_ania>
            <cod_ramo>string</cod_ramo>
            <cod_prodotto>string</cod_prodotto>
            <dt_effetto>dateTime</dt_effetto>
            <dt_scadenza>dateTime</dt_scadenza>
            <hhmm_effetto>string</hhmm_effetto>
            <hhmm_scadenza>string</hhmm_scadenza>
            <stato_contratto>string</stato_contratto>
            <contratto xsi:nil="true" xmlns="urn:WiseWebServicePtf.Contratto" />
            <coll_contraente xsi:nil="true" xmlns="urn:WiseWebServicePtf.Contraenti" />
            <coll_allegati xsi:nil="true" xmlns="urn:WiseWebServicePtf.Allegati" />
            <coll_bene xsi:nil="true" xmlns="urn:WiseWebServicePtf.Beni" />
            <coll_coass xsi:nil="true" xmlns="urn:WiseWebServicePtf.Coass" />
            <coll_regpremio xsi:nil="true" xmlns="urn:WiseWebServicePtf.RegolazionePremi" />
            <coll_variabilepolizza xsi:nil="true" xmlns="urn:WiseWebServicePtf.VariabiliPolizza" />
            <coll_polizzacollegata xsi:nil="true" xmlns="urn:WiseWebServicePtf.PolizzeCollegate" />
            <premiofirma xsi:nil="true" xmlns="urn:WiseWebServicePtf.PremioFirma" />
          </polizza>
        </azioneepoli>
      </azioniEPOLI>
    </EmettiPolizze>
  </soap:Body>
</soap:Envelope>
